# Задача 30. Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

# a=int(input("Введите первый элемент арифметической прогрессии: "))
# d=int(input("Введите разность арифметической прогрессии: "))
# n=int(input("Введитет количетво элементов арифметической прогрессии: "))


# Arr=[]
# for i in range(n):
#     k=a+(n-1)*d
#     n-=1
#     Arr.append(k)

# print(sorted(Arr))


# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

# Минимум =5, Максимум =15

# strat_1=[-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# end_1 = []

# for i in range(len(strat_1)):
#     if strat_1[i] > 5 and strat_1[i]:
#         end_1.append(i)
# print(end_1)






